OpenFOAM/OutWit.Controller.OpenFOAM.Tests/Fixtures/SphereInBox/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            slip;
    }

    // The patch snappyHexMesh cuts: no mesh has it until the sphere is snapped.
    sphere
    {
        type            noSlip;
    }
}
