OpenFOAM/OutWit.Controller.OpenFOAM.Tests/Fixtures/SphereInBox/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;

nu              0.01;
